# WorksharingTooltipInfo Properties

---
The WorksharingTooltipInfo type exposes the following members.
| Name| Description
---|---|---
| Creator|  The user name of the user who created the element.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LastChangedBy|  The user name of the most recent user who saved a user change of this element to the central model.
| Owner|  The current owner of the element or empty string if no one owns the element.
Top
#### Reference
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace